<!-- placeholder-1 -->
```fish
tofu plan -chdir=opentofu -var-file=env/prod.tfvars -var-file=secret.tfvars -refresh=true -workspace=prod
```
<!-- placeholder-2 -->

<details><summary>Diff of 3 changes.</summary>

```diff
! module.mongodb.mongodbatlas_project.project will be updated in-place
+ module.mongodb.mongodbatlas_project_ip_access_list.ip_access_list["0.0.0.0/0"] will be created
+ module.s3.minio_s3_bucket.bucket["prod-discord-409696112144810014"] will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 2 to add, 1 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @sillock1 at 2025-05-16T12:35:10Z [(view log)](https://github.com/opentoucan/infrastructure-config/actions/runs/15068572570/job/42358964142#step:6:1).
</summary>

```hcl

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

OpenTofu will perform the following actions:

  # module.mongodb.mongodbatlas_project.project will be updated in-place
  ~ resource "mongodbatlas_project" "project" {
        id                                               = "65d4a3bf160f504f2547c2cd"
      ~ name                                             = "production" -> "prod"
      + region_usage_restrictions                        = (known after apply)
      + with_default_alerts_settings                     = true
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.mongodb.mongodbatlas_project_ip_access_list.ip_access_list["0.0.0.0/0"] will be created
  + resource "mongodbatlas_project_ip_access_list" "ip_access_list" {
      + aws_security_group = (known after apply)
      + cidr_block         = "0.0.0.0/0"
      + comment            = "ip address for accessing project"
      + id                 = (known after apply)
      + ip_address         = (known after apply)
      + project_id         = "65d4a3bf160f504f2547c2cd"
    }

  # module.s3.minio_s3_bucket.bucket["prod-discord-409696112144810014"] will be created
  + resource "minio_s3_bucket" "bucket" {
      + acl                = "private"
      + arn                = (known after apply)
      + bucket             = "prod-discord-409696112144810014"
      + bucket_domain_name = (known after apply)
      + force_destroy      = false
      + id                 = (known after apply)
      + object_locking     = false
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- tofu-3-90cfc6bef2878e6b34a1ef3359834a8b.tfplan -->
<!-- placeholder-6 -->